---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetBoundary
source: html/34f9d5ec-7195-0324-60a4-a2d51d8b2ab8.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetBoundary Method

Gets the collection of polygons that form the 2D boundary.
 This method returns a collection of polyloops (planar
 polygons) that defines an enclosed area measured by
 interior bounding surfaces.

## Syntax (C#)
```csharp
public IList<Polyloop> GetBoundary()
```

## Returns
The collection of polygons that form the 2D boundary.